# Требуется написать программу, которая проверяет счастливость билета.

T=int(input("Введите номер билета: "))
P=T//1000
P1=P//100
P2=(P - P1*100)//10
Sum1=P%10 + P1 + P2
N=T%1000
N1=N//100
N2=(N - N1*100)//10
Sum2=N%10 + N1 + N2
resolt="YES" if Sum1==Sum2 else "NO"
print(resolt)